# GroupBy

In [4]:
import pandas as pd

In [7]:
data=pd.DataFrame({"Name":['a','b','c','d','e','d','a','c','b','e'],
                   
                    "s1":[21,76,32,76,34,90,33,21,66,56],
                    "s2":[22,86,32,74,34,97,93,11,36,50]
                  })

print(data)

  Name  s1  s2
0    a  21  22
1    b  76  86
2    c  32  32
3    d  76  74
4    e  34  34
5    d  90  97
6    a  33  93
7    c  21  11
8    b  66  36
9    e  56  50

In [10]:
ans=data.groupby("Name")
print(ans)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001EC12CC8B10>

In [11]:
for x,y in ans:
    print(x)
    print(y)

a
  Name  s1  s2
0    a  21  22
6    a  33  93
b
  Name  s1  s2
1    b  76  86
8    b  66  36
c
  Name  s1  s2
2    c  32  32
7    c  21  11
d
  Name  s1  s2
3    d  76  74
5    d  90  97
e
  Name  s1  s2
4    e  34  34
9    e  56  50

In [12]:
ans.get_group("c")

  Name  s1  s2
2    c  32  32
7    c  21  11

In [13]:
ans.min()

      s1  s2
Name
a     21  22
b     66  36
c     21  11
d     76  74
e     34  34

In [14]:
ans.max()

      s1  s2
Name
a     33  93
b     76  86
c     32  32
d     90  97
e     56  50

In [16]:
list(ans)

[('a',
    Name  s1  s2
  0    a  21  22
  6    a  33  93),
 ('b',
    Name  s1  s2
  1    b  76  86
  8    b  66  36),
 ('c',
    Name  s1  s2
  2    c  32  32
  7    c  21  11),
 ('d',
    Name  s1  s2
  3    d  76  74
  5    d  90  97),
 ('e',
    Name  s1  s2
  4    e  34  34
  9    e  56  50)]